// cnsToolDllIF.h : main header file for the CNSTOOLDLL DLL
/*---------------------------------------------------------------------
* 文 件	名： cnsToolDllIF.h
* 功    能： cnsToolDll 的接口文件 
* 特殊说明：
* 修改记录：
* 日期			版本		修改人		修改记录
* 2012.11.21   1.0          俞锦锦        创建
----------------------------------------------------------------------*/

#ifndef CNSTOOLDLLIF_HEAD_H
#define CNSTOOLDLLIF_HEAD_H 


#ifdef  CNSTOOLDLL_EXPORTS
#define CNSTOOLDLL_API extern "C" __declspec(dllexport)
#else 
#define CNSTOOLDLL_API extern "C" __declspec(dllimport)
#endif

namespace CNSTOOL
{
 
	////////////CnsToolDll 所有接口/////////////////////////////
	//
	
	/*---------------------------------------------------------------------
	* 功    能：是否已经初始化cnsTool环境
	* 输入参数：
	* 输出参数：
	* 返 回 值：
	* 备    注：  
	* 日期			版本		修改人		修改记录
	* 2012.11.21    1.0         俞锦锦        创建
	----------------------------------------------------------------------*/
	CNSTOOLDLL_API BOOL _stdcall IsInitCnsTool();


	/*---------------------------------------------------------------------
	* 功    能：初始化cnsTool环境
	* 输入参数：hNotifyWnd  dll外部接受dll消息通知的窗口
	* 输出参数：
	* 返 回 值：
	* 备    注：  
	* 日期			版本		修改人		修改记录
	* 2012.11.21    1.0         俞锦锦        创建
	----------------------------------------------------------------------*/
	CNSTOOLDLL_API void _stdcall InitCnsTool( HWND hNotifyWnd );


	/*---------------------------------------------------------------------
	* 功    能：销毁cnsTool 
	* 输入参数：
	* 输出参数：
	* 返 回 值：
	* 备    注：  
	* 日期			版本		修改人		修改记录
	* 2012.11.30    1.0         俞锦锦        创建
	----------------------------------------------------------------------*/
	CNSTOOLDLL_API void _stdcall DestroyCnsTool();



	/*---------------------------------------------------------------------
	* 功    能：登陆cns服务器
	* 输入参数：
	* 输出参数：
	* 返 回 值：成功返回NO_ERROR（0），失败返回错误码
	* 备    注：  
	* 日期			版本		修改人		修改记录
	* 2012.11.21    1.0         俞锦锦        创建
	----------------------------------------------------------------------*/
	CNSTOOLDLL_API UINT _stdcall ConnectCns( DWORD dwCnsIP, DWORD dwCnsPort = 60002, CString strUserName = "", CString strPswd = "" );
 
 

	/*---------------------------------------------------------------------
	* 功    能：所有cnsTool相关的消息都应通过此接口来处理
	* 输入参数：pMsg消息指针
	* 输出参数：
	* 返 回 值：若CNSTOOL处理该消息，则返回TRUE，未处理返回FALSE
	* 备    注：  
	* 日期			版本		修改人		修改记录
	* 2012.11.30    1.0         俞锦锦        创建
	----------------------------------------------------------------------*/
	CNSTOOLDLL_API BOOL _stdcall HandleCnsToolMsg( MSG* pMsg );
 
}

 
#endif 
