#ifndef __IMTCMATRIX_H__
#define __IMTCMATRIX_H__
//liuruifei.tony20051220创建

#include "dispevent.h"

class IMtcMatrix : public CDispEvent
{
public:
	/*=============================================================================
	  函 数 名： GetAllSche
	  功    能： 获取全部的矩阵方案信息
	  算法实现： 
	  全局变量： 
	  参    数： 无
	  返 回 值： vector<TAVInnerMatrixScheme>  全部矩阵方案向量
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2004/01/20     4.0		刘瑞飞                  注释
	=============================================================================*/
    virtual vector<TAVInnerMatrixScheme>& GetAllSche() = 0;

	/*=============================================================================
	  函 数 名： GetAllHDSche
	  功    能： 获取全部的高清终端矩阵方案信息
	  算法实现： 
	  全局变量： 
	  参    数： 无
	  返 回 值： vector<THDAVInnerMatrixScheme>  全部矩阵方案向量
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2008/01/10     4.0		王廖荣                  创建
	=============================================================================*/
    virtual vector<TVInnerMatrixScheme>& GetAllHDSche() = 0;

	/*=============================================================================
	  函 数 名： GetCurSche
	  功    能： 获取当前应用的矩阵方案
	  算法实现： 
	  全局变量： 
	  参    数： 无
	  返 回 值： u8  当前应用的矩阵方案序号
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2004/01/20     4.0		刘瑞飞                  注释
	=============================================================================*/
	virtual u8 GetCurSche() const = 0;
	/*=============================================================================
	  函 数 名： ReqAllMatrixScheme
	  功    能： 请求全部矩阵的方案信息
	  算法实现： 
	  全局变量： 
	  参    数： 无
	  返 回 值： u16      成功返回0，失败返回非0
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2004/01/20     4.0		刘瑞飞                  注释
	=============================================================================*/
	virtual u16 ReqAllMatrixScheme() = 0; 
	/*=============================================================================
	  函 数 名： ReqMatrixScheme
	  功    能： 请求一个矩阵方案类型（方案索引从( 0 - 6 )( 0 为默认方案 )）
	  算法实现： 
	  全局变量： 
	  参    数： 无
	  返 回 值： u16      成功返回0，失败返回非0
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2004/01/20     4.0		刘瑞飞                  注释
	=============================================================================*/
	virtual u16 ReqMatrixScheme(u8 byIndex) = 0;
	/*=============================================================================
	  函 数 名： SaveScheme
	  功    能： 保存一个矩阵方案
	  算法实现： 
	  全局变量： 
	  参    数： const TAVInnerMatrixScheme& tAVMatrix    矩阵方案
	  返 回 值： u16      成功返回0，失败返回非0
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2004/01/20     4.0		刘瑞飞                  注释
	=============================================================================*/
	virtual u16 SaveScheme(const TAVInnerMatrixScheme& tAVMatrix) = 0;

	/*=============================================================================
	  函 数 名： SaveHDScheme
	  功    能： 保存高清终端一个矩阵方案
	  算法实现： 
	  全局变量： 
	  参    数： const THDAVInnerMatrixScheme& tAVMatrix    矩阵方案
	  返 回 值： u16      成功返回0，失败返回非0
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2008/01/10     4.0		王廖荣                  创建
	=============================================================================*/
//	virtual u16 SaveHDScheme(const THDAVInnerMatrixScheme& tAVMatrix) = 0;

	/*=============================================================================
	  函 数 名： GetCurApplySche
	  功    能： 请求当前应用的矩阵方案
	  算法实现： 
	  全局变量： 
	  参    数： 
	  返 回 值： u16      成功返回0，失败返回非0
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2004/01/20     4.0		刘瑞飞                  注释
	=============================================================================*/
	virtual u16 GetCurApplySche(u8 byIndex) = 0;
	/*=============================================================================
	  函 数 名： SetCurApplySche
	  功    能： 设置已有的为应用方案
	  算法实现： 
	  全局变量： 
	  参    数： u8 byIndex   方案的序号
	  返 回 值： u16      成功返回0，失败返回非0
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2004/01/20     4.0		刘瑞飞                  注释
	=============================================================================*/
//	virtual u16 SetCurApplySche(u8 byIndex) = 0;
//////////////////////////////////////////////////////////////////////////
//以下为外部矩阵,-----抽象为扩展视频源
	

	/*=============================================================================
	  函 数 名： ReqExternalMatrixInfo
	  功    能： 请求外部矩阵信息请求
	  算法实现： 
	  全局变量： 
	  参    数：
	  返 回 值： u16      成功返回0，失败返回非0
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2004/01/20     4.0		刘瑞飞                  注释
	=============================================================================*/
	virtual u16 ReqExternalMatrixInfo() = 0;
	/*=============================================================================
	  函 数 名： SaveExVideoSourceInfo
	  功    能： 外部矩阵的端口名的保存
	  算法实现： 
	  全局变量： 
	  参    数：TVideoSourceInfo tVSourceInfo  扩展视频源信息
	  返 回 值： u16      成功返回0，失败返回非0
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2004/01/20     4.0		刘瑞飞                  注释
	=============================================================================*/
	virtual u16 SaveExVideoSourceInfo(TVideoSourceInfo tVSourceInfo ) = 0;
	/*=============================================================================
	  函 数 名： ReqExVideoSourceInfo
	  功    能： 请求外部矩阵的端口名的保存
	  算法实现： 
	  全局变量： 
	  参    数：TVideoSourceInfo tVSourceInfo  扩展视频源信息
	  返 回 值： u16      成功返回0，失败返回非0
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2004/01/20     4.0		刘瑞飞                  注释
	=============================================================================*/
	virtual u16 ReqExVideoSourceInfo() = 0;
	/*=============================================================================
	  函 数 名： GetExVSourceCap
	  功    能： 获取外部矩阵的能力 
	  算法实现： 
	  全局变量： 
	  参    数：
	  返 回 值： u8       外部矩阵的能力(有多少个输入源)
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2004/01/20     4.0		刘瑞飞                  注释
	=============================================================================*/
	virtual u8 GetExVSourceCap() = 0;
	/*=============================================================================
	  函 数 名： GetInPutIndex
	  功    能： 获取扩展视频源的输入源的序号
	  算法实现： 
	  全局变量： 
	  参    数：
	  返 回 值：u8 输入源的序号
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2004/01/20     4.0		刘瑞飞                  注释
	=============================================================================*/
	virtual u8 GetInPutIndex() = 0;
	/*=============================================================================
	  函 数 名： GetExMatrixInfo
	  功    能： 得到外部矩阵信息请求
	  算法实现： 
	  全局变量： 
	  参    数：
	  返 回 值：TExternalMatrixInfo  外部矩阵的详细信息
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2004/01/20     4.0		刘瑞飞                  注释
	=============================================================================*/
	virtual const TExternalMatrixInfo& GetExMatrixInfo() = 0;
	/*=============================================================================
	  函 数 名： GetVideoSourceInfo
	  功    能： 得到扩展视频源的信息
	  算法实现： 
	  全局变量： 
	  参    数：
	  返 回 TVideoSourceInfo  扩展视频源的信息
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2004/01/20     4.0		刘瑞飞                  注释
	=============================================================================*/
	virtual TVideoSourceInfo* GetVideoSourceInfo() = 0;
	/*=============================================================================
	  函 数 名： SwitchExVSource
	  功    能： 切换扩展视频源
	  算法实现： 
	  全局变量： 
	  参    数：u8 byIndex   要切换的视频源的序号
	  返 回      
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2004/01/20     4.0		刘瑞飞                  注释
	=============================================================================*/
	virtual u16 SwitchExVSource(u8 byIndex) = 0;
	/*=============================================================================
	  函 数 名： EnableDVI
	  功    能： 是否启用DVI格式输出
	  算法实现： 
	  全局变量： 
	  参    数：BOOL bEnable   是否启用
	  返 回      
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	  2008/10/31     4.0		陈建辉                  注释
	=============================================================================*/	
	virtual u16 EnableDVI(BOOL32 bEnable) = 0;
	/*=============================================================================
	  函 数 名： GetEnableDVI
	  功    能： 获取是否启用DVI格式输出
	  算法实现： 
	  全局变量： 
	  参    数： 无
	  返 回 值： BOOL  当前是否启用DVI格式输出
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	   2008/10/31     4.0		陈建辉                  注释
	=============================================================================*/
	virtual  BOOL32  GetEnableDVI() const = 0;



	/*=============================================================================
	  函 数 名： ReqAllLocalMatrixScheme
	  功    能： 请求获取本地的全部矩阵
	  算法实现： 
	  全局变量： 
	  参    数： 无
	  返 回 值： u16  发出请求是否成功
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	   2009/12/30     4.0		沈  钦                  注释
	=============================================================================*/
	virtual u16 SaveAllLocalMatrixScheme(TVInnerMatrixScheme *tScheme) = 0;


	/*=============================================================================
	  函 数 名： ReqExtraModeType
	  功    能： 请求获取本地的扩展矩阵
	  算法实现： 
	  全局变量： 
	  参    数： 无
	  返 回 值： u16  发出请求是否成功
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	   2009/12/30     4.0		沈  钦                  注释
	=============================================================================*/
	virtual u16 ReqExtraModeType() = 0;

	/*=============================================================================
	  函 数 名： GetExtraModeType
	  功    能： 获取本地的扩展矩阵
	  算法实现： 
	  全局变量： 
	  参    数： 无
	  返 回 值： 返回类型  
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	   2009/12/30     4.0		沈  钦                  注释
	=============================================================================*/
	virtual u8	GetExtraModeType() = 0;
	/*=============================================================================
	  函 数 名： ApplyCurSche
	  功    能： 设置当前序号的方案为指定方案
	  算法实现： 
	  全局变量： 
	  参    数： byIndex
	  返 回 值： 返回类型  
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	   2009/12/30     4.0		沈  钦                  注释
	=============================================================================*/
	virtual u16 ApplyCurSche(u8 byIndex) = 0;

	/*=============================================================================
	  函 数 名： UpdateAudioMatrix
	  功    能： 设置音频矩阵方案
	  算法实现： 
	  全局变量： 
	  参    数： THdAudioPort
	  返 回 值：   
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	   2010/1/16     4.0		沈  钦                  注释
	=============================================================================*/
	virtual u16 UpdateAudioMatrix( THdAudioPort & tMatrix ) = 0;
	/*=============================================================================
	  函 数 名： GetAudioMatrix
	  功    能： 获得音频矩阵方案
	  算法实现： 
	  全局变量： 
	  参    数： 
	  返 回 值： THdAudioPort  
	  -----------------------------------------------------------------------------
	  修改记录：
	  日  期		版本		修改人		走读人    修改内容
	   2010/1/16     4.0		沈  钦                  注释
	=============================================================================*/
	virtual THdAudioPort& GetAudioMatrix() = 0;
}; // IMtcMatrix

#endif