/*=============================================================================
模   块   名: 会议控制台业务功能库
文   件   名: mcslibcom.h
相 关  文 件: mcslibcom.cpp
文件实现功能: mcslib中普通函数的实现
作        者: 王昊
版        本: V4.0  Copyright(C) 2003-2005 KDC, All rights reserved.
-------------------------------------------------------------------------------
修改记录:
日      期  版本    修改人      修改内容
2005/05/23  4.0     王昊        创建
=============================================================================*/

#ifndef _MCSLIBCOM_20050523_H_
#define _MCSLIBCOM_20050523_H_

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

#include "mcslib.h"

//  记录所有数据
//  判断会话是否存在即判断会话里的实例号m_wInsId是否为0, 为0则不存在
//  会话不连续, 需要循环。例如: 可能[0]存在, [1]为空, 但[2]存在
typedef struct tagCtrlData
{
public:
    tagCtrlData()
    {
        ZeroMemory(m_awMonitorPort,     sizeof (m_awMonitorPort));
        ZeroMemory(m_aaszMcuName,       sizeof (m_aaszMcuName));
        ZeroMemory(m_aaszUserName,      sizeof (m_aaszUserName));
        ZeroMemory(m_abMonitor,         sizeof (m_abMonitor));
        ZeroMemory(m_aaszMcuIp,         sizeof (m_aaszMcuIp));
    }

public:
    CMcuSession m_acMcuSession[MAXNUM_MCS_MCU];     //  MCU会话
    TCHAR       m_aaszMcuName[MAXNUM_MCS_MCU][MAXLEN_MCU_NAME]; //  MCU名称
    TCHAR       m_aaszUserName[MAXNUM_MCS_MCU][MAX_CHARLENGTH]; //  当前连接使用的用户名
    TCHAR       m_aaszMcuIp[MAXNUM_MCS_MCU][16];    //  MCU IP地址
    u16         m_awMonitorPort[MAXNUM_MCS_MCU];    //  监视端口
    bool        m_abMonitor[MAXNUM_MCS_MCU];        //  是否监视
} TCtrlData;


/*=============================================================================
函 数 名:McsInit
功    能:会控初始化
参    数:u16 wListenPort                [in]    telnet端口
         BOOL32 bOpenTelnet             [in]    是否打开telnet窗口
注    意:无
返 回 值:成功返回MCSLIB_OK, 失败返回错误码
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2005/06/21  4.0     王昊    创建
=============================================================================*/
u16 McsInit(u16 wListenPort = 0, BOOL32 bOpenTelnet = FALSE);

/*=============================================================================
函 数 名:McsQuit
功    能:退出会控
参    数:无
注    意:无
返 回 值:成功返回MCSLIB_OK, 失败返回错误码
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2005/06/21  4.0     王昊    创建
=============================================================================*/
u16 McsQuit(void);

/*=============================================================================
函 数 名:GetNextFreeSession
功    能:获取下一个可用于连接新MCU的会话
参    数:CString& cstrMcuIp         [in]  要求连接的MCU IP
         CMcuSession** pSession      [out] 返回的Session指针
注    意:连接新MCU时用到
返 回 值:TRUE 表示有可用，FALSE表示没有可用，或者已连接,
         找到空或者现有的，则pSession返回session指针。没可用则pSession返回NULL
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2006/03/07  4.0     顾振华  创建
=============================================================================*/
BOOL32 GetNextFreeSession(CString& cstrMcuIp, CMcuSession** pSession);


/*=============================================================================
函 数 名:SetCurrentSession
功    能:设置当前会话
参    数:s32 nIndex         [in]    会话在g_tCtrlData.m_acMcuSession中的位置
注    意:切换MCU时用到
返 回 值:无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2005/06/27  4.0     王昊    创建
=============================================================================*/
void SetCurrentSession(s32 nIndex);

/*=============================================================================
函 数 名:GetAllMcuSession
功    能:获取所有MCU会话
参    数:CMcuSession *pMcuSessionList       [out]   MCU会话列表
注    意:存在空会话
返 回 值:无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2005/06/21  4.0     王昊    创建
=============================================================================*/
inline void GetAllMcuSession(CMcuSession *pMcuSessionList);

/*=============================================================================
函 数 名:GetMcsLibErrorDetails
功    能:返回McsLib库调用的错误信息
参    数:u16 wErrorCode                     [in]    调用mcslib库返回的错误码
注    意:无
返 回 值:错误码信息描述
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2005/05/23  4.0     王昊    创建
=============================================================================*/
//CString GetMcsLibErrorDetails(u16 wErrorCode);

/*=============================================================================
函 数 名:GetMcuErrorDetails
功    能:返回MCU的错误信息
参    数:u16 wErrorCode                     [in]    MCU提供的错误码
         EMLangID emLangId                  [in]    语言种类
注    意:无
返 回 值:错误码信息描述
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2005/05/23  4.0     王昊    创建
=============================================================================*/
CString GetMcuErrorDetails( u16 wErrorCode, EMLangID emLangId = emEnglish );

/*=============================================================================
函 数 名:SetLangID
功    能:设置语言类型
参    数:EMLangID emLanId                   [in]    语言类型
注    意:无
返 回 值:无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2005/06/14  4.0     王昊    创建
=============================================================================*/
//void SetLangID(EMLangID emLanId);

/*=============================================================================
函 数 名:GetMcslibString
功    能:获取mcslib里的字符串
参    数:CString cstrKey                   [in]    key name
注    意:无
返 回 值:字符串描述
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2005/06/20  4.0     王昊    创建
=============================================================================*/
//inline CString GetMcslibString(CString cstrKey);

/*=============================================================================
函 数 名:GetEventContent
功    能:获取事件描述
参    数:u16 wEventId                       [in]    事件号
注    意:无
返 回 值:事件描述
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2005/06/21  4.0     王昊    创建
=============================================================================*/
LPCTSTR GetEventContent(u16 wEventId);

/*=============================================================================
函 数 名:GetTimerOspHint
功    能:得到当指定定时器的名称，主要用于Osp提示
参    数:EMTimerWaitState emTimer               [in]    定时状态
注    意:无
返 回 值:成功返回提示字串，失败返回NULL
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2005/06/24  4.0     王昊    创建
=============================================================================*/
LPCTSTR GetTimerOspHint(EMTimerWaitState emTimer);

/*=============================================================================
函 数 名:GetTimerMsgTip
功    能:得到指定定时器的文字提示信息，主要用于返回给上层应用
参    数:EMTimerWaitState emTimer               [in]    定时状态
注    意:无
返 回 值:定时器文字提示信息
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2005/06/24  4.0     王昊    创建
=============================================================================*/
//CString GetTimerMsgTip(EMTimerWaitState emTimer);

/*=============================================================================
函 数 名:GetLanString
功    能:获取字符串内容
参    数:LPCTSTR pszKeyValue                    [in]    字符串描述
         TCHAR aszDefaultValue                  [in]    默认值
注    意:用于多语言
返 回 值:字符串内容
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2005/08/12  4.0     王昊    创建
=============================================================================*/
//CString GetLanString( LPCTSTR pszKeyValue, TCHAR aszDefaultValue[] = _T("") );

//  接收MCU的CServMsg消息后检查内部状态
#define STATE_DEAL(pcSession)                       \
{                                                   \
    if ( ! pcSession->IsSerialNoTrue(&cServMsg) )   \
    {                                               \
        return;                                     \
    }                                               \
    pHandler->McslibKillTimer( TIMER_WAIT_REPLY );     \
    pcSession->m_emTimerState = emTimerWaitNormal;  \
}

//  接收MCU的CAddrBookMsg消息后处理。
//  地址簿消息里面没有流水号的信息, 故不做检验
//#define ADDR_STATE_DEAL(pcSession)                  \
//{                                                   \
//    pHandler->McslibKillTimer( TIMER_WAIT_REPLY );  \
//    pcSession->m_emTimerState = emTimerWaitNormal;  \
//}

//  发送REQ指令之前检查内部状态
#define NORMAL_CHECK                                    \
{                                                       \
    if (m_wState != MCSLIB_STATE_NORMAL)                \
    {                                                   \
        ::OspLog( LOGLVL_EXCEPTION,                     \
                 _T("[MCSLIB]m_wState(%d) is not MCSLIB_STATE_NORMAL!\n"),  \
                 m_wState );                            \
        return MCSLIB_NOT_IN_NORMAL_STATE;			    \
    }                                                   \
    if (m_emTimerState != emTimerWaitNormal)	        \
    {                                                   \
        ::OspLog( LOGLVL_EXCEPTION,                     \
                  _T("[MCSLIB]m_emTimerState(%d:%s) is not TIMER_WAIT_NORMAL!\n"), \
                  m_emTimerState, GetTimerOspHint( m_emTimerState ) );                     \
        return MCSLIB_MUST_WAIT;					    \
    }                                                   \
}

//  打印会议消息
#define PRTCONFMSG(LogMsg)                          \
    if (CMcuSession::s_bPrtConfMsg)                 \
    {                                               \
        LogMsg;                                     \
    }

//  打印外设消息
#define PRTPERIMSG(LogMsg)                          \
    if (CMcuSession::s_bPrtPeriMsg)                 \
    {                                               \
        LogMsg;                                     \
    }

//  打印地址簿消息
#define PRTADDRMSG(LogMsg)                          \
    if (CMcuSession::s_bPrtAddrMsg)                 \
    {                                               \
        LogMsg;                                     \
    }

//  打印用户消息
#define PRTUSERMSG(LogMsg)                          \
    if (CMcuSession::s_bPrtUserMsg)                 \
    {                                               \
        LogMsg;                                     \
    }

//  打印终端消息
#define PRTMTMSG(LogMsg)                            \
    if (CMcuSession::s_bPrtMtMsg)                   \
    {                                               \
        LogMsg;                                     \
    }

//  打印MCU消息
#define PRTMCUMSG(LogMsg)                           \
    if (CMcuSession::s_bPrtMcuMsg)                  \
    {                                               \
        LogMsg;                                     \
    }

//  打印MCS向MCU发送的消息体
#define PRTMCSBODY(LogMsg)                          \
    if ( CMcuSession::s_bPrtMcsMsgBody )            \
    {                                               \
        LogMsg;                                     \
    }

//  打印MCU向MCS发送的消息体
#define PRTMCUBODY(LogMsg)                          \
    if ( CMcuSession::s_bPrtMcuMsgBody )            \
    {                                               \
        LogMsg;                                     \
    }

/*=============================================================================
函 数 名:CheatConfInfo
功    能:会议信息作弊
参    数:TConfInfo &tConfInfo                       [in/out]    会议信息
         BOOL32 bWrite                              [in]        写入/读取
注    意:无
返 回 值:无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2005/06/10  3.6     王昊    创建
=============================================================================*/
void CheatConfInfo(TConfInfo &tConfInfo, BOOL32 bWrite);

/*=============================================================================
函 数 名:IsNewConfPollStyleEnable
功    能:是否启用新的会议轮询方式
参    数:
注    意:BOOL32     是否启用新的会议轮询方式（TRUE为启用）
返 回 值:无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/04/02  4.0     王廖荣    创建
=============================================================================*/
BOOL32 IsNewConfPollStyleEnable();

/*=============================================================================
函 数 名:IsCallMtExEnable
功    能:是否采用呼叫终端的扩展结构呼叫终端（包括呼叫的媒体格式）
参    数:
注    意:BOOL32     是否采用呼叫终端的扩展结构呼叫终端（TRUE为启用）
返 回 值:无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2008/10/30  4.0     王廖荣    创建
=============================================================================*/
BOOL32 IsCallMtExEnable();

class CDebugOut
{
public:
    /*=============================================================================
    函 数 名:ListAllSession
    功    能:罗列所有MCU会话
    参    数:无
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void ListAllSession();

    /*=============================================================================
    函 数 名:ListSession
    功    能:显示MCU会话状态
    参    数:无
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void ListSession(s32 nSessionIdx = INDEX_ERR);

    /*=============================================================================
    函 数 名:ListAllConf
    功    能:罗列指定MCU上所有即时会议
    参    数:s32 nSessionIdx                        [in]    指定MCU会话
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void ListAllConf(s32 nSessionIdx = INDEX_ERR);

    /*=============================================================================
    函 数 名:ListConfInfo
    功    能:罗列指定即时会议信息
    参    数:s32 nConfIdx                           [in]    指定会议
             s32 nSessionIdx                        [in]    指定MCU会话
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void ListConfInfo(s32 nConfIdx = INDEX_ERR, s32 nSessionIdx = INDEX_ERR);

    /*=============================================================================
    函 数 名:ListMcuTable
    功    能:罗列指定会议CMcuTable
    参    数:s32 nConfIdx                           [in]    指定会议
             s32 nSessionIdx                        [in]    指定MCU会话
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void ListMcuTable(s32 nConfIdx = INDEX_ERR, s32 nSessionIdx = INDEX_ERR);

    /*=============================================================================
    函 数 名:ListConfAllMtInfo
    功    能:罗列指定会议TConfAllMtInfo
    参    数:s32 nConfIdx                           [in]    指定会议
             s32 nSessionIdx                        [in]    指定MCU会话
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void ListConfAllMtInfo(s32 nConfIdx = INDEX_ERR,
                                  s32 nSessionIdx = INDEX_ERR);

    /*=============================================================================
    函 数 名:ListMtList
    功    能:罗列指定单极MCU终端列表
    参    数:s32 nMcuIdx                            [in]    指定MCU
             s32 nConfIdx                           [in]    指定会议
             s32 nSessionIdx                        [in]    指定MCU会话
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void ListMtList(s32 nMcuIdx = INDEX_ERR, s32 nConfIdx = INDEX_ERR,
                           s32 nSessionIdx = INDEX_ERR);

    /*=============================================================================
    函 数 名:ListMtInfo
    功    能:罗列指定终端信息
    参    数:s32 nMtIndex                           [in]    指定终端
             s32 nMcuIdx                            [in]    指定MCU
             s32 nConfIdx                           [in]    指定会议
             s32 nSessionIdx                        [in]    指定MCU会话
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void ListMtInfo(s32 nMtIndex = INDEX_ERR, s32 nMcuIdx = INDEX_ERR,
                           s32 nConfIdx = INDEX_ERR, s32 nSessionIdx = INDEX_ERR);

    /*=============================================================================
    函 数 名:ListAllMonitor
    功    能:罗列所有监控通道
    参    数:s32 nSessionIdx                        [in]    指定MCU会话
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/25  4.0     王昊    创建
    =============================================================================*/
    static void ListAllMonitor(s32 nSessionIdx = INDEX_ERR);

    /*=============================================================================
    函 数 名:ListMonitor
    功    能:罗列指定监控通道
    参    数:s32 nChannelIdx                        [in]    指定通道
             s32 nSessionIdx                        [in]    指定MCU会话
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/08/25  4.0     王昊    创建
    =============================================================================*/
    static void ListMonitor(s32 nChannelIdx = INDEX_ERR,
                            s32 nSessionIdx = INDEX_ERR);

    /*=============================================================================
    函 数 名:ListPeri
    功    能:罗列指定MCU所有外设
    参    数:s32 nSessionIdx                        [in]    指定MCU会话
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void ListPeri(s32 nSessionIdx = INDEX_ERR);

    /*=============================================================================
    函 数 名:ListPeriInfo
    功    能:罗列MCU上指定外设信息
    参    数:s32 nEqpId                             [in]    指定外设
             s32 nSessionIdx                        [in]    指定MCU会话
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void ListPeriInfo(s32 nEqpId, s32 nSessionIdx = INDEX_ERR);

    /*=============================================================================
    函 数 名:PrtAddrBook
    功    能:罗列指定MCU上地址簿信息
    参    数:s32 nSessionIdx                        [in]    指定MCU会话
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void PrtAddrBook(s32 nSessionIdx = INDEX_ERR);

    /*=============================================================================
    函 数 名:ListAllUser
    功    能:罗列指定MCU上所有用户信息
    参    数:s32 nSessionIdx                        [in]    指定MCU会话
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void ListAllUser(s32 nSessionIdx = INDEX_ERR);

    /*=============================================================================
    函 数 名:ListMcuCfg
    功    能:罗列指定MCU
    参    数:s32 nSessionIdx                        [in]    指定MCU会话
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/09/01  4.0     王昊    创建
    =============================================================================*/
    static void ListMcuCfg(s32 nSessionIdx = INDEX_ERR);

    /*=============================================================================
    函 数 名:ListScheduleConf
    功    能:罗列所有预约会议
    参    数:s32 nSessionIdx                        [in]    指定MCU会话
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/11/23  4.0     王昊    创建
    =============================================================================*/
    static void ListScheduleConf(s32 nSessionIdx = INDEX_ERR);

    /*=============================================================================
    函 数 名:ListConfTemplate
    功    能:罗列所有会议模板
    参    数:s32 nSessionIdx                        [in]    指定MCU会话
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/11/23  4.0     王昊    创建
    =============================================================================*/
    static void ListConfTemplate(s32 nSessionIdx = INDEX_ERR);

    /*=============================================================================
    函 数 名:ListAllBoard
    功    能:列出所有单板信息
    参    数:s32 nSessionIdx                        [in]    指定MCU会话
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2006/08/21  4.0     王昊    创建
    =============================================================================*/
    static void ListAllBoard(s32 nSessionIdx = INDEX_ERR);

private:
    /*=============================================================================
    函 数 名:GetSessionPtr
    功    能:获取MCU会话
    参    数:CMcuSession* &pcSession                [out]   MCU会话
             s32 nSessionIdx                        [in]    指定MCU会话
    注    意:无
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static BOOL32 GetSessionPtr(CMcuSession* &pcSession, s32 nSessionIdx);

    /*=============================================================================
    函 数 名:GetConfPtr
    功    能:获取CConf
    参    数:CConf* &pcConf                         [out]   CConf
             s32 nConfIdx                           [in]    指定会议
             CMcuSession *pcSession                 [in]    MCU会话
    注    意:无
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static BOOL32 GetConfPtr(CConf* &pcConf, s32 nConfIdx,
                             CMcuSession *pcMcuSession);

    /*=============================================================================
    函 数 名:PrtTvWall
    功    能:打印电视墙信息
    参    数:const TPeriEqpStatus &tEqpStatus   [in]    电视墙信息
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void PrtTvWall(const TPeriEqpStatus &tEqpStatus);

    /*=============================================================================
    函 数 名:PrtRecorder
    功    能:打印录像机信息
    参    数:const TPeriEqpStatus &tEqpStatus   [in]    录像机信息
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void PrtRecorder(const TPeriEqpStatus &tEqpStatus);

    /*=============================================================================
    函 数 名:PrtMixer
    功    能:打印混音器信息
    参    数:const TPeriEqpStatus &tEqpStatus   [in]    混音器信息
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void PrtMixer(const TPeriEqpStatus &tEqpStatus);

    /*=============================================================================
    函 数 名:PrtAdapter
    功    能:打印码流适配器信息
    参    数:const TPeriEqpStatus &tEqpStatus   [in]    码流适配器信息
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void PrtAdapter(const TPeriEqpStatus &tEqpStatus);

    /*=============================================================================
    函 数 名:PrtPrs
    功    能:打印丢包重传器信息
    参    数:const TPeriEqpStatus &tEqpStatus   [in]    丢包重传器信息
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void PrtPrs(const TPeriEqpStatus &tEqpStatus);

    /*=============================================================================
    函 数 名:PrtVmp
    功    能:打印画面合成器信息
    参    数:const TPeriEqpStatus &tEqpStatus   [in]    画面合成器信息
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/06/21  4.0     王昊    创建
    =============================================================================*/
    static void PrtVmp(const TPeriEqpStatus &tEqpStatus);

    /*=============================================================================
    函 数 名:PrtMultiTvWall
    功    能:PrtMultiTvWall
    参    数:const TPeriEqpStatus &tEqpStatus   [in]    多画面电视墙信息
    注    意:无
    返 回 值:无
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2005/10/14  4.0     王昊    创建
    =============================================================================*/
    static void PrtMultiTvWall(const TPeriEqpStatus &tEqpStatus);

private:
    static s32                      s_nSessionIndex;
    static s32                      s_nConfIndex;
    static s32                      s_nMcuIndex;
    static s32                      s_nMtIndex;
};

#endif  //  _MCSLIBCOM_20050523_H_