/*=============================================================================
模   块   名: 文件升级客户端业务功能库
文   件   名: suclibapi.h
相 关  文 件: suclibapi.cpp
文件实现功能: suclib对界面的全局接口函数
作        者: 王昊
版        本: V1.0  Copyright(C) 2006-2007 Kedacom, All rights reserved.
-------------------------------------------------------------------------------
修改记录:
日      期  版本    修改人      修改内容
2007/02/12  1.0     王昊        创建
=============================================================================*/

#ifndef _SUCLIBAPI_
#define _SUCLIBAPI_

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

#include "suclib.h"
#include <afxmt.h>
#include "filesrvclientstruct.h"


typedef struct tagCtrlData
{
public:
    CSucSession     m_acSucSession[MAXINST_SUCLIB_NUM]; //会话数据
} TCtrlData;




extern TCtrlData        *g_ptCtrlData;      //全局数据
extern CSucSession      *g_pcCurSession;    //当前会话(界面使用)
//extern bool             g_bNotifUi;         //数据是否通知界面(控制仅通知当前显示SUS的消息)
extern CCriticalSection g_cLock;            //资源访问锁

extern bool             g_bPrintPostMsg;    //是否打印发向服务器的消息
extern bool             g_bPrintRecvMsg;    //是否打印从服务器接收到的消息
extern bool             g_bPrintUIMsg;      //是否打印发向UI的消息

/*=============================================================================
函 数 名: SuclibInit
功    能: 初始化
参    数: u16 wTelnetPort               [in]    telnet端口
          BOOL32 bOpenTelnet            [in]    是否打开telnet窗口
注    意: 无
返 回 值: 成功: TRUE; 失败: FALSE
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/02/12  1.0     王昊    创建
=============================================================================*/
BOOL32 SuclibInit(u16 wTelnetPort = 0, BOOL32 bOpenTelnet = FALSE);

/*=============================================================================
函 数 名: SuclibQuit
功    能: 退出
参    数: 无
注    意: 无
返 回 值: 无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/02/12  1.0     王昊    创建
=============================================================================*/
void SuclibQuit(void);

/*=============================================================================
函 数 名: GetNextFreeSession
功    能: 获取下一个空闲的实例
参    数: u32 dwNewIP                   [in]    新接入SUS的 IP地址(主机序)
          CSucSession* &pcSession       [out]   空闲的Session
注    意: 无
返 回 值: 找到实例: TRUE; 没有找到或已连接: FALSE
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/02/13  1.0     王昊    创建
=============================================================================*/
BOOL32 GetNextFreeSession(u32 dwNewIP, CSucSession* &pcSession);

/*=============================================================================
函 数 名: SetCurrentSession
功    能: 设置当前会话
参    数: u32 dwSusIP                   [in]    服务器IP地址(主机序)
注    意: 无
返 回 值: 无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/02/13  1.0     王昊    创建
=============================================================================*/
void SetCurrentSession(u32 dwSusIP);

/*=============================================================================
函 数 名: SetCurrentSession
功    能: 设置当前会话
参    数: CSucSession *pcSession        [in]    会话
注    意: 无
返 回 值: 无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/03/01  1.0     王昊    创建
=============================================================================*/
//void SetCurrentSession(CSucSession *pcSession);

/*=============================================================================
函 数 名: GetEventDesc
功    能: 获取消息描述
参    数: u16 wEventId                  [in]    消息号
注    意: 无
返 回 值: 事件描述
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/02/13  1.0     王昊    创建
=============================================================================*/
LPCTSTR GetEventDesc(u16 wEventId);

/*=============================================================================
函 数 名: GetSusEventDesc
功    能: 获取SUS消息描述
参    数: u16 wEventId                  [in]    消息号
注    意: 无
返 回 值: 事件描述
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/02/13  1.0     王昊    创建
=============================================================================*/
LPCTSTR GetSusEventDesc(u16 wEventId);

/*=============================================================================
函 数 名: GetLibEventDesc
功    能: 获取Suclib消息描述
参    数: u16 wEventId                  [in]    消息号
注    意: 无
返 回 值: 事件描述
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/02/13  1.0     王昊    创建
=============================================================================*/
LPCTSTR GetLibEventDesc(u16 wEventId);

/*=============================================================================
函 数 名: GetErrorDesc
功    能: 获取Suclib错误描述
参    数: u16 wErrorCode                [in]    错误码
          EMFileSrvLanType emLanType    [in]    语言类型
注    意: 无
返 回 值: 错误描述
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/02/13  1.0     王昊    创建
=============================================================================*/
LPCTSTR GetErrorDesc(u16 wErrorCode, EMFileSrvLanType emLanType);

/*=============================================================================
函 数 名: GetTimedoutDesc
功    能: 获取超时描述
参    数: u16 wWaitEventID              [in]    等待消息
          EMFileSrvLanType emLanType    [in]    语言类型
注    意: 无
返 回 值: 超时描述
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/03/03  1.0     王昊    创建
=============================================================================*/
LPCTSTR GetTimedoutDesc(u16 wWaitEventID, EMFileSrvLanType emLanType);

/*=============================================================================
函 数 名: LoadVer
功    能: 载入文件
参    数: const CAddVerInfo &cInfo      [in]    版本信息
          vector<CSucFile> &vctFile     [in]    文件内容
注    意: 无
返 回 值: 载入成功: TRUE; 载入失败: FALSE
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/02/14  1.0     王昊    创建
=============================================================================*/
BOOL32 LoadVer(const CAddVerInfo &cInfo, vector<CSucFile> &vctFile);

/*=============================================================================
函 数 名: ClearVectorFile
功    能: 清空vector<CSucFile>的数据
参    数: vector<CSucFile> &vctFile     [in]    文件内容
注    意: 无
返 回 值: 无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/03/13  1.0     王昊    创建
=============================================================================*/
void ClearVectorFile(vector<CSucFile> &vctFile);

///////////////////////////////////////////////////////////////////////////////
//  帮助打印
///////////////////////////////////////////////////////////////////////////////

/*=============================================================================
函 数 名: suclibver
功    能: 版本号打印
参    数: 无
注    意: 无
返 回 值: 无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/04/17  1.0     王昊    创建
=============================================================================*/
API void suclibver(void);

/*=============================================================================
函 数 名: suclibhelp
功    能: 帮助命令打印
参    数: 无
注    意: 无
返 回 值: 无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/06/15  1.0     王昊    创建
=============================================================================*/
API void suclibhelp(void);

/*=============================================================================
函 数 名: msghelp
功    能: 消息命令打印
参    数: 无
注    意: 无
返 回 值: 无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/06/15  1.0     王昊    创建
=============================================================================*/
API void msghelp(void);

/*=============================================================================
函 数 名: debughelp
功    能: 调试命令打印
参    数: 无
注    意: 无
返 回 值: 无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/06/15  1.0     王昊    创建
=============================================================================*/
API void debughelp(void);

/*=============================================================================
函 数 名: pallmsg
功    能: 打印所有消息
参    数: 无
注    意: 无
返 回 值: 无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/06/15  1.0     王昊    创建
=============================================================================*/
API void pallmsg(void);

/*=============================================================================
函 数 名: npallmsg
功    能: 关闭打印所有消息
参    数: 无
注    意: 无
返 回 值: 无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/06/15  1.0     王昊    创建
=============================================================================*/
API void npallmsg(void);

/*=============================================================================
函 数 名: psusmsg
功    能: 打印服务器投递消息
参    数: 无
注    意: 无
返 回 值: 无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/06/15  1.0     王昊    创建
=============================================================================*/
API void psusmsg(void);

/*=============================================================================
函 数 名: npsusmsg
功    能: 关闭打印服务器投递消息
参    数: 无
注    意: 无
返 回 值: 无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/06/15  1.0     王昊    创建
=============================================================================*/
API void npsusmsg(void);

/*=============================================================================
函 数 名: puimsg
功    能: 打印发向界面的消息
参    数: 无
注    意: 无
返 回 值: 无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/06/15  1.0     王昊    创建
=============================================================================*/
API void puimsg(void);

/*=============================================================================
函 数 名: npuimsg
功    能: 关闭打印发向界面的消息
参    数: 无
注    意: 无
返 回 值: 无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/06/15  1.0     王昊    创建
=============================================================================*/
API void npuimsg(void);

/*=============================================================================
函 数 名: psendmsg
功    能: 打印发向服务器的消息
参    数: 无
注    意: 无
返 回 值: 无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/06/15  1.0     王昊    创建
=============================================================================*/
API void psendmsg(void);

/*=============================================================================
函 数 名: npsendmsg
功    能: 关闭打印发向服务器的消息
参    数: 无
注    意: 无
返 回 值: 无
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/06/15  1.0     王昊    创建
=============================================================================*/
API void npsendmsg(void);

#endif//_SUCLIBAPI_
