/*****************************************************************************
模块名      : CUmstoolCommon
文件名      : umstoolcommon.h
相关文件    : 
文件实现功能: umstool公共函数
作者        : 刘德印
版本        : V1.0  Copyright(C) 2012-2013 KDV, All rights reserved.
-----------------------------------------------------------------------------
修改记录:
日  期         版本        修改人      修改内容
2012/10/30     1.0         刘德印      创建
******************************************************************************/
#if !defined(AFX_UMSTOOLCOMMON_H__F6C0ACAA_4E1E_4E6E_8FA5_FFB4E33A67AC__INCLUDED_)
#define AFX_UMSTOOLCOMMON_H__F6C0ACAA_4E1E_4E6E_8FA5_FFB4E33A67AC__INCLUDED_

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

class CUmstoolCommon  
{
public:
	CUmstoolCommon();
	virtual ~CUmstoolCommon();


public:
	/*=============================================================================
    函 数 名:IsFileExist
    功    能:检测文件是否存在
    参    数:const CString& strFileFullPath    [in]     文件全路径名称
    注    意:无
    返 回 值:TRUE: 成功   FALSE:失败
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人    修改内容
    2012/12/14  1.0     刘德印    创建
    =============================================================================*/
	static BOOL IsFileExist(const CString& strFileFullPath);

	/*=============================================================================
    函 数 名:IsFolderExist
    功    能:检测目录是否存在
    参    数:const CString& strFolderFullPath    [in]     目录全路径名称
    注    意:无
    返 回 值:TRUE: 成功   FALSE:失败
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人    修改内容
    2012/12/14  1.0     刘德印    创建
    =============================================================================*/
	static BOOL IsFolderExist(const CString& strFolderFullPath);

	/*=============================================================================
    函 数 名:IsIniFile
    功    能:检测是否是ini文件用于会议模板和地址文件检测
    参    数:const String& strFileName    [in]     文件全路径名称
    注    意:无
    返 回 值:TRUE: 成功   FALSE:失败
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人    修改内容
    2012/12/14  1.0     刘德印    创建
    =============================================================================*/
	static BOOL IsIniFile(const String& strFileName);

	/*=============================================================================
    函 数 名:GetIpStr
    功    能:将普通类型转化为IP串
    参    数:unsigned int dwIPAddr    [in]     IP的整型表示形式
    注    意:无
    返 回 值:类似“127.0.0.1”形式
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人    修改内容
    2012/12/14  1.0     刘德印    创建
    =============================================================================*/
	static CString GetIpStr(unsigned int dwIPAddr);

	/*=============================================================================
    函 数 名:TimeToTm
    功    能:转换time_t时间为tm结构
    参    数: struct tm& tmDate                          [in]    time_t待转化时间
	参    数: const time_t& timeDate                     [in]    转换后的tm时间
    注    意:无
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2012/12/19  1.0     刘德印    创建
    =============================================================================*/
	static void TimeToTm( struct tm& tmDate, const time_t& timeDate );

	/*=============================================================================
    函 数 名:NotifyOuterWnd
    功    能: 传递消息到tptool窗口
    参    数: UINT nMsge                          [in]    消息ID
	参    数: WPARAM LPARAM内容
    注    意:无
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2012/12/19  1.0     刘德印    创建
    =============================================================================*/
	static BOOL NotifyOuterWnd( UINT nMsg , WPARAM wparam, LPARAM lparam );

	/*=============================================================================
    函 数 名:SetLstSelItem
    功    能: 设置列表控件的选中行（默认去除选中项）
    参    数: const String& strLstWnd        [in]    列表名
	参    数: IWndTree* pWndTree		     [in]    窗口所在
	参    数: s32 nItemNo					 [in]    选中行号
    注    意:无
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2013/01/17  1.0     刘德印    创建
    =============================================================================*/
	static void SetLstSelItem( const String& strLstWnd, IWndTree* pWndTree = NULL, s32 nItemNo = -1 );

	/*=============================================================================
    函 数 名: RecusionMkDir
    功    能: 递归创建目录， 如果目录已经存在或者创建成功返回TRUE
    参    数: CString strFolder        [in]    待创建文件夹路径
    注    意:无
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2013/01/28  1.0     刘德印    创建
    =============================================================================*/
	static BOOL RecusionMkDir(CString strFolder);

	/*=============================================================================
    函 数 名: GetFileFolderPath
    功    能: 得到文件所在文件夹路径名
    参    数: const String& strFilePath        [in]    文件全路径名
    注    意:无
    返 回 值:String     文件所在文件夹路径名
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2013/01/28  1.0     刘德印    创建
    =============================================================================*/
	static String GetFileFolderPath(const String& strFilePath);

	/*=============================================================================
    函 数 名: OpenBrowseForFolder
    功    能: 浏览打开文件目录（应用在文件保存、下载、导出等）
    参    数: const String& strFileName        [in]    文件名
	参    数: HWND hWnd                        [in]    若为模态对话框，hWnd为父窗口句柄  by xhx
    参    数: BOOL bIsAddFileName              [in]    是否附加文件名   FALSE则直接得到目录名
    注    意:无
    返 回 值:String     文件全路径
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2013/01/28  1.0     刘德印    创建
    =============================================================================*/
	static String OpenBrowseForFolder(const String& strFileName, HWND hWnd = NULL, BOOL bIsAddFileName = TRUE );

	/*=============================================================================
    函 数 名: OpenFileDialog
    功    能: 打开文件目录（应用在文件另存为、导入、打开等）
    参    数: const String& strFilter			  [in]    过滤文件
    参    数: const String& strDefFileName        [in]    默认显示文件名
    参    数: const String& strDefFileName        [out]    文件全路径
    参    数: BOOL bOpenStyle					  [out]    文件名
	参    数: BOOL bUpdate						  [out]	  是否帅选出升级的目标文件(.bin or .gz)
    参    数: BOOL bOpenStyle					  [in]    标明是浏览还是保存
    注    意:无
    返 回 值:String     文件全路径
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2013/01/28  1.0     刘德印    创建
    =============================================================================*/
	static BOOL OpenFileDialog( const String& strFilter, const String& strDefFileName, String& strFilePathName,
		 String& strFileName, BOOL bOpenStyle = TRUE, BOOL bUpdate = FALSE );

	/*=============================================================================
    函 数 名: CheckTransferFile
    功    能: 检测传输全路径和文件名的合法性
    参    数: const String strFileFullPath    [in]     待检测的文件全路径
    参    数: const String strCheckFileName   [in]     待检测的文件名 
    注    意:无
    返 回 值:BOOL
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2013/01/28  1.0     刘德印    创建
    =============================================================================*/
	static BOOL CheckTransferFile( const String& strFileFullPath, const String& strCheckFileName );

	/*=============================================================================
    函 数 名: GetFileSize
    功    能: 得到文件大小
    参    数: const String strFilePath    [in]     文件全路径
    注    意:无
    返 回 值:u64 字节数
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2013/02/01  1.0     刘德印    创建
    =============================================================================*/
	static u64 GetFileSize( const String& strFilePath );

	/*=============================================================================
    函 数 名:  GetDeviceName
    功    能: 获取设备名数据（即电视墙单板页面的模式名）
    参    数: void
    注    意:无
    返 回 值:设备vector
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2013/02/01  1.0     刘德印    创建
    =============================================================================*/
	static std::vector<CString> GetDeviceName();

	/*=============================================================================
    函 数 名:  IsInvalidChar
    功    能:  特殊字符判断
    参    数: const String strText    [in]     待判断字符串
    参    数: int argc                [in]     待判断字符数
    注    意:  无
    返 回 值:  TRUE:含有特殊字符  否则不含
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2013/02/01  1.0     刘德印    创建
    =============================================================================*/
	static BOOL IsInvalidChar(const String& strText, int argc, ...);

private:



};

//指针清空
#define SAFE_RELEASE(x) if((x) != NULL){ delete (x); (x) = NULL; } 
#define SAFE_RELEASE_ARRAY(x) if((x) != NULL){ delete[] (x); (x) = NULL; } 



#endif // !defined(AFX_UMSTOOLCOMMON_H__F6C0ACAA_4E1E_4E6E_8FA5_FFB4E33A67AC__INCLUDED_)
