/*****************************************************************************
模块名      : GkcLib
文件名      : GkcLibInterface.h
相关文件    : GkcLibInterface.cpp
文件实现功能: 定义了接口类CGkcLibInterface，该类提供上层GkConsole使用的下行接口
              定义上行窗口消息的消息号
              
作者        : 陈洪斌
模块版本    : V4.0  Copyright(C) 2002-2005 KDC, All rights reserved.
-----------------------------------------------------------------------------
修改记录:
日  期(n/m/d)      文件版本        修改人      修改内容
2005/08/05          1.0            陈洪斌      创建
******************************************************************************/

#if !defined(AFX_GKCLIBINTERFACE_H__137E5A9D_40A9_4C04_92DA_AB78D40831BC__INCLUDED_)
#define AFX_GKCLIBINTERFACE_H__137E5A9D_40A9_4C04_92DA_AB78D40831BC__INCLUDED_

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

#include "GkcLibDefine.h"
class CGkcLibInterface  
{
public:
	CGkcLibInterface();
	virtual ~CGkcLibInterface();
public:
//////////////////////////////////////////////////////////////////////////
//初始化                                                                         
//////////////////////////////////////////////////////////////////////////
   
    /*====================================================================
    函数名      :InitSystem
    功能        :初始化Lib
    输入参数说明:回调窗口句柄
    返回值说明  :错误码
    ====================================================================*/    
    DWORD InitSystem(HWND hWndConsole);
//////////////////////////////////////////////////////////////////////////
//释放Lib                                                                         
//////////////////////////////////////////////////////////////////////////
   
    /*====================================================================
    函数名      :ReleaseLib
    功能        :释放Lib库
    输入参数说明:无
    返回值说明  :无
    ====================================================================*/    

    void ReleaseLib();

//////////////////////////////////////////////////////////////////////////
// 登录和注销
//////////////////////////////////////////////////////////////////////////

    /*====================================================================
    函数名      :ConnectToGK
    功能        :登录GK服务器
    输入参数说明:dwGkIpAddress : GK服务器IP地址
                 wGkPort : GK侦听端口
                 tUser : 登录的用户信息
    返回值说明  :错误码
    ====================================================================*/
    DWORD ConnectToGK(DWORD dwGkIpAddress , u16 wGkPort , TCtrlUserDBData& tUser);

    /*====================================================================
    函数名      :DisConnectFromGK
    功能        :注销用户登录
    输入参数说明:无
    返回值说明  :错误码
    ====================================================================*/
    DWORD DisConnectFromGK();

//////////////////////////////////////////////////////////////////////////
// 运行时接口
//////////////////////////////////////////////////////////////////////////
    /*====================================================================
    函数名      :RestartGK
    功能        :重起GK
    输入参数说明:无
    返回值说明  :错误码
    ====================================================================*/
    DWORD RestartGK();

    /*====================================================================
    函数名      :GetRegEndpointList
    功能        :获取已注册H323实体列表
    输入参数说明:无
    返回值说明  :错误码
    ====================================================================*/
    DWORD GetRegEndpointList();

    /*====================================================================
    函数名      :UnRegisterEndpoint
    功能        :强制注销H323实体
    输入参数说明:dwTimerId: 包含实体标示信息(来自于TGKCtrlBufBodyHead结构中的m_dwTimerId)
    返回值说明  :错误码
    ====================================================================*/
    DWORD UnRegisterEndpoint(u32 dwTimerId );

    /*====================================================================
    函数名      :GetCallList
    功能        :获取某个H323实体呼叫列表
    输入参数说明:dwTimerId: 包含实体标示信息(来自于TGKCtrlBufBodyHead结构中的m_dwTimerId)
    返回值说明  :错误码
    ====================================================================*/
    DWORD GetCallList(u32 dwTimerId );

    /*====================================================================
    函数名      :StopCall
    功能        :强制结束呼叫
    输入参数说明:dwCallId: 呼叫id (来自于TCallIdDBData结构中的m_dwIRRTimerId)
    返回值说明  :错误码
    ====================================================================*/
    DWORD StopCall(u32 dwCallId);

//////////////////////////////////////////////////////////////////////////
// 配置接口 -- 基本配置
//////////////////////////////////////////////////////////////////////////
    /*====================================================================
    函数名      :GetBaseConfig
    功能        :获取GK基本配置
    输入参数说明:无
    返回值说明  :错误码
    ====================================================================*/
    DWORD GetBaseConfig();
    
    /*====================================================================
    函数名      :SetBaseConfig
    功能        :设置GK基本配置
    输入参数说明:tBaseConfig: 基本配置信息
    返回值说明  :错误码
    ====================================================================*/
    DWORD SetBaseConfig(TConfigBaseGKDBData& tBaseConfig);

    /*====================================================================
    函数名      :GetPrefix
    功能        :刷新（获取）区号列表
    输入参数说明:无
    返回值说明  :错误码
    ====================================================================*/
    DWORD GetPrefix();

    /*====================================================================
    函数名      :AddPrefix
    功能        :新增区号
    输入参数说明:tGkPrefix: 增加的区号信息
    返回值说明  :错误码
    ====================================================================*/
    DWORD AddPrefix(TGKPrefix& tGkPrefix);

    /*====================================================================
    函数名      :DelPrefix
    功能        :删除区号
    输入参数说明:tGkPrefix: 删除的区号信息
    返回值说明  :错误码
    ====================================================================*/
    DWORD DelPrefix(TGKPrefix& tGkPrefix);

    /*====================================================================
    函数名      :GetNeighborGk
    功能        :刷新（获取）临近GK服务器列表
    输入参数说明:无
    返回值说明  :错误码
    ====================================================================*/
    DWORD GetNeighborGk();

    /*====================================================================
    函数名      :AddNeighborGk
    功能        :新增临近GK服务器
    输入参数说明:tNeighborGkInfo : 新增临近GK服务器信息
    返回值说明  :错误码
    ====================================================================*/
    DWORD AddNeighborGk(TNeighborGKInfo& tNeighborGkInfo);

    /*====================================================================
    函数名      :DelNeighborGk
    功能        :删除某个临近GK服务器
    输入参数说明:tNeighborGkInfo : 删除的临近GK服务器信息
    返回值说明  :错误码
    ====================================================================*/
    DWORD DelNeighborGk(TNeighborGKInfo& tNeighborGkInfo);

    /*====================================================================
    函数名      :GetAuthMethod
    功能        :刷新（获取）GK注册认证策略
    输入参数说明:无
    返回值说明  :错误码
    ====================================================================*/
    DWORD GetAuthMethod();

    /*====================================================================
    函数名      :SetAuthMethod
    功能        :配置GK注册认证策略
    输入参数说明:cAuthMethod: 认证策略信息(CGkAuthMotho由GkcLib定义)
    返回值说明  :错误码
    ====================================================================*/
    DWORD SetAuthMethod(CGkAuthMothod cAuthMethod);

    /*=============================================================================
    函 数 名:GetEthNetPort
    功    能:获取本地GK使用网口(前网口还是后网口)
    参    数:无
    注    意:无
    返 回 值:错误码
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2006/02/11  4.0     王昊    创建
    =============================================================================*/
    u32 GetEthNetPort(void) const;

    /*=============================================================================
    函 数 名:SetEthNetPort
    功    能:设置本地GK使用网口(前网口还是后网口)
    参    数:BOOL32 bFrontPort              [in]    TRUE: 前网口; FALSE: 后网口
    注    意:无
    返 回 值:错误码
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2006/02/11  4.0     王昊    创建
    =============================================================================*/
    u32 SetEthNetPort(BOOL32 bFrontPort) const;

    /*=============================================================================
    函 数 名:GetRadiusConf
    功    能:获取Radius服务器配置
    参    数:无
    注    意:无
    返 回 值:错误码
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2006/11/17  4.0     王昊    创建
    =============================================================================*/
    u32 GetRadiusConf(void) const;

    /*=============================================================================
    函 数 名:SetRadiusConf
    功    能:设置Radius服务器配置
    参    数:const TRadiusConfigInfo &tInfo         [in]    Radius服务器配置
    注    意:无
    返 回 值:错误码
    -------------------------------------------------------------------------------
    修改纪录:
    日      期  版本    修改人  修改内容
    2006/11/17  4.0     王昊    创建
    =============================================================================*/
    u32 SetRadiusConf(const TRadiusConfigInfo &tInfo) const;

//////////////////////////////////////////////////////////////////////////
//  配置接口 -- 网段带宽配置接口
//////////////////////////////////////////////////////////////////////////
    /*====================================================================
    函数名      :GetSubnetBandwidthList
    功能        :刷新（获取）网段间带宽列表
    输入参数说明:无
    返回值说明  :错误码
    ====================================================================*/
    DWORD GetSubnetBandwidthList();

    /*====================================================================
    函数名      :AddSubnetBandwidth
    功能        :新增网段间带宽
    输入参数说明:tAddCfgBandwidth: 新增网段间带宽信息
    返回值说明  :错误码
    ====================================================================*/
    DWORD AddSubnetBandwidth(TConfigBandWidthDBData& tAddCfgBandwidth);

    /*====================================================================
    函数名      :DelSubnetBandwidth
    功能        :删除网段间带宽
    输入参数说明:tDelCfgBandwidth: 删除的网段间带宽信息
    返回值说明  :错误码
    ====================================================================*/
    DWORD DelSubnetBandwidth(TConfigBandWidthDBData& tDelCfgBandwidth);

    /*====================================================================
    函数名      :ModifySubnetBandwidth
    功能        :修改网段间带宽
    输入参数说明:tOldCfgBandwidth: 修改前的网段间带宽信息
                 tNewCfgBandwidth: 修改后的网段间带宽信息
    返回值说明  :错误码
    ====================================================================*/
    DWORD ModifySubnetBandwidth(TConfigBandWidthDBData& tOldCfgBandwidth,
                                TConfigBandWidthDBData& tNewCfgBandwidth);

//////////////////////////////////////////////////////////////////////////
//  配置接口 -- 认证Ip范围配置接口
//////////////////////////////////////////////////////////////////////////
    /*====================================================================
    函数名      :SendPermitOrForbidFlag
    功能        :获取禁止认证按钮
    输入参数说明:无
    返回值说明  :错误码
    ====================================================================*/
	DWORD GetIpRangeListbyForbidden();

    /*====================================================================
    函数名      :GetIpRangeList
    功能        :刷新（获取）认证IP范围列表
    输入参数说明:无
    返回值说明  :错误码
    ====================================================================*/
    DWORD GetIpRangeList(); 

    /*====================================================================
    函数名      :AddIpRange
    功能        :新增认证Ip范围
    输入参数说明:tAddCfgIpRange:新增Ip范围信息
    返回值说明  :错误码
    ====================================================================*/
    DWORD AddIpRange(TConfigAuthIPDBData& tAddCfgIpRange); 
    
    /*====================================================================
    函数名      :DelIpRange
    功能        :删除认证Ip范围
    输入参数说明:tDelCfgIpRange:删除Ip范围信息
    返回值说明  :错误码
    ====================================================================*/
    DWORD DelIpRange(TConfigAuthIPDBData& tDelCfgIpRange); 

    /*====================================================================
    函数名      :ModifyIpRange
    功能        :修改认证Ip范围
    输入参数说明:tOldCfgIpRange:修改前的Ip范围信息
                 tNewCfgIpRange:修改后的Ip范围信息
    返回值说明  :错误码
    ====================================================================*/
    DWORD ModifyIpRange(TConfigAuthIPDBData& tOldCfgIpRange,
                        TConfigAuthIPDBData& tNewCfgIpRange);

//////////////////////////////////////////////////////////////////////////
//  配置接口 -- 认证实体配置接口
//////////////////////////////////////////////////////////////////////////
    /*====================================================================
    函数名      :GetEndpointList
    功能        :刷新（获取）认证实体列表
    输入参数说明:无
    返回值说明  :错误码
    ====================================================================*/
    DWORD GetEndpointList(); 

    /*====================================================================
    函数名      :AddEndpoint
    功能        :新增认证实体
    输入参数说明:tAddCfgEndpoint: 新增禁止/允许实体
    返回值说明  :错误码
    ====================================================================*/
    DWORD AddEndpoint(TConfigEntityAuthDBData& tAddCfgEndpoint);

    /*====================================================================
    函数名      :DelEndpoint
    功能        :删除认证实体
    输入参数说明:tDelCfgEndpoint: 删除禁止/允许实体
    返回值说明  :错误码
    ====================================================================*/
    DWORD DelEndpoint(TConfigEntityAuthDBData& tDelCfgEndpoint);
    
    /*====================================================================
    函数名      :ModifyEndpoint
    功能        :修改认证实体
    输入参数说明:tOldCfgEndpoint: 修改前的认证实体
                 tNewCfgEndpoint: 修改后的认证实体
    返回值说明  :错误码
    ====================================================================*/
    DWORD ModifyEndpoint(TConfigEntityAuthDBData& tOldCfgEndpoint,
                         TConfigEntityAuthDBData& tNewCfgEndpoint);
 
    /*====================================================================
    函数名      :GetPasswordList
    功能        :刷新（获取）密码认证列表
    输入参数说明:无
    返回值说明  :错误码
    ====================================================================*/
    DWORD GetPasswordList(); 

    /*====================================================================
    函数名      :AddPassword
    功能        :新增密码认证
    输入参数说明:TConfigAliasAuthDBData: 新增密码认证
    返回值说明  :错误码
    ====================================================================*/
	DWORD AddPassword(TConfigAliasAuthDBData& tAddPwdCfg);
	
    /*====================================================================
    函数名      :DelPassword
    功能        :删除密码认证
    输入参数说明:TConfigAliasAuthDBData: 删除密码认证
    返回值说明  :错误码
    ====================================================================*/
	DWORD DelPassword(TConfigAliasAuthDBData &tDelPwdCfg);

    /*====================================================================
    函数名      :ModifyPassword
    功能        :修改密码认证
    输入参数说明: TConfigAliasAuthDBData 当前修改的条码,以164号做索引
    返回值说明  :错误码
    ====================================================================*/
	DWORD ModifyPassword(TConfigAliasAuthDBData &OldPwdCfg, 
							TConfigAliasAuthDBData& tNewPwdCfg);

//////////////////////////////////////////////////////////////////////////
//  用户管理接口
//////////////////////////////////////////////////////////////////////////
    /*====================================================================
    函数名      :GetUserList
    功能        :刷新（获取）用户列表
    输入参数说明:无
    返回值说明  :错误码
    ====================================================================*/
    DWORD GetUserList();
    
    /*====================================================================
    函数名      :AddUser
    功能        :新增用户
    输入参数说明:tAddUser: 新增用户信息
    返回值说明  :错误码
    ====================================================================*/
    DWORD AddUser(TCtrlUserDBData& tAddUser);
    
    /*====================================================================
    函数名      :DelUser
    功能        :删除用户
    输入参数说明:tDelUser: 删除用户信息
    返回值说明  :错误码
    ====================================================================*/
    DWORD DelUser(TCtrlUserDBData& tDelUser);

    /*====================================================================
    函数名      :ModifyUser
    功能        :修改用户
    输入参数说明:tOldUser: 修改前的用户信息
                 tNewUser: 修改后的用户信息
    返回值说明  :错误码
    ====================================================================*/
    DWORD ModifyUser(TCtrlUserDBData& tOldUser, TCtrlUserDBData& tNewUser);

    /*====================================================================
    函数名      :ModifyUserPwd
    功能        :修改用户密码
    输入参数说明:tOldUser: 修改前的用户信息
                 tNewUser: 修改后的用户信息
    返回值说明  :错误码
    ====================================================================*/
    DWORD ModifyUserPwd(TCtrlUserDBData& tOldUser, TCtrlUserDBData& tNewUser);    
    
    /*====================================================================
    函数名      :GetOneUserInfo
    功能        :刷新（获取）某个用户信息
    输入参数说明:tQueryUser: 要查询的用户
    返回值说明  :错误码
    ====================================================================*/
    DWORD GetOneUserInfo(TCtrlUserDBData& tQueryUser);

//////////////////////////////////////////////////////////////////////////
//  其他功能接口
//////////////////////////////////////////////////////////////////////////
};

#endif // !defined(AFX_GKCLIBINTERFACE_H__137E5A9D_40A9_4C04_92DA_AB78D40831BC__INCLUDED_)
