#pragma once
#include "previewAsisst.h"

class UILIB_API CPreviewIF
{
public:
	CPreviewIF(void);
	~CPreviewIF(void);

public:
	/*---------------------------------------------------------------------
	* 功    能：设置预览窗口及坐标
	* 输入参数：hwndPreview 预览窗口， Rc位置
	* 输出参数：
	* 返 回 值：成功返回S_OK,失败返回错误码
	* 备    注：  pRc 是相对于屏幕的坐标
	* 日期			版本		修改人		修改记录
	* 2013.3.4      1.0         俞锦锦        创建
	----------------------------------------------------------------------*/
	void  SetWindow( HWND hwndPreview, RECT&Rc );
	

	/*---------------------------------------------------------------------
	* 功    能：设置预览窗口大小及坐标
	* 输入参数：Rc位置
	* 输出参数：
	* 返 回 值：成功返回S_OK,失败返回错误码
	* 备    注： pRc 是相对于屏幕的坐标
	* 日期			版本		修改人		修改记录
	* 2013.3.4      1.0         俞锦锦        创建
	----------------------------------------------------------------------*/
	void SetRect( RECT &Rc ); 
 

 
	/*-------------------------------------------------------------------
	* 功    能：开始预览文件
	* 输入参数：szFile 要预览的文件
	* 输出参数：
	* 返 回 值：成功返回S_OK,失败返回错误码
	* 备    注：设置过预览窗口和位置后再调用该接口 
	* 日期			版本		修改人		修改记录
	* 2013.3.4      1.0         俞锦锦        创建
	-------------------------------------------------------------------*/
	LONG DoPreview(  LPCTSTR szFile  );
	 

	/*-------------------------------------------------------------------
	* 功    能：开始预览文件
	* 输入参数：szFile 要预览的文件
	* 输出参数：
	* 返 回 值：成功返回S_OK,失败返回错误码
	* 备    注：
	* 日期			版本		修改人		修改记录
	* 2013.3.4      1.0         俞锦锦        创建
	-------------------------------------------------------------------*/
	LONG DoPreview( HWND hWnd, RECT &rectPreview, LPCTSTR szFile) ;


	/*-------------------------------------------------------------------
	* 功    能：停止预览文件
	* 输入参数： 
	* 输出参数：
	* 返 回 值： 
	* 备    注：
	* 日期			版本		修改人		修改记录
	* 2013.3.4      1.0         俞锦锦        创建
	-------------------------------------------------------------------*/
	void Unload();

private:
	CPreviewAsisst  m_preAs;
	//CPreviewImg*    m_pPreImg;


	HWND            m_hwndPreview;//预览窗口
	RECT            m_rcPreview;  //预览位置

};

