/*---------------------------------------------------------------------
* 文 件	名： previewAsisst.h
* 功    能： 预览文件 
* 特殊说明：
* 修改记录：
* 日期			版本		修改人		修改记录
* 2013.3.4      1.0         俞锦锦        创建
----------------------------------------------------------------------*/

#pragma once
 
#define SAFERELEASE( X ) { if( X ) { X->Release(); X = NULL; } }

class UILIB_API CPreviewAsisst
{
public:
	 CPreviewAsisst(void);
	~CPreviewAsisst(void);


public:
	/*---------------------------------------------------------------------
	* 功    能：设置预览窗口及坐标
	* 输入参数：hwndPreview 预览窗口， Rc位置
	* 输出参数：
	* 返 回 值：成功返回S_OK,失败返回错误码
	* 备    注：  pRc 是相对于屏幕的坐标
	* 日期			版本		修改人		修改记录
	* 2013.3.4      1.0         俞锦锦        创建
	----------------------------------------------------------------------*/
	LONG  SetPrevWindow( HWND hwndPreview, RECT&Rc );
	

	/*---------------------------------------------------------------------
	* 功    能：设置预览窗口大小及坐标
	* 输入参数：Rc位置
	* 输出参数：
	* 返 回 值：成功返回S_OK,失败返回错误码
	* 备    注： pRc 是相对于屏幕的坐标
	* 日期			版本		修改人		修改记录
	* 2013.3.4      1.0         俞锦锦        创建
	----------------------------------------------------------------------*/
	LONG SetPrevRect( RECT &Rc ); 
 

 
	/*-------------------------------------------------------------------
	* 功    能：开始预览文件
	* 输入参数：szFile 要预览的文件
	* 输出参数：
	* 返 回 值：成功返回S_OK,失败返回错误码
	* 备    注：设置过预览窗口和位置后再调用该接口 
	* 日期			版本		修改人		修改记录
	* 2013.3.4      1.0         俞锦锦        创建
	-------------------------------------------------------------------*/
	LONG DoPreview(  LPCTSTR szFile  );
	 

	/*-------------------------------------------------------------------
	* 功    能：开始预览文件
	* 输入参数：szFile 要预览的文件
	* 输出参数：
	* 返 回 值：成功返回S_OK,失败返回错误码
	* 备    注：
	* 日期			版本		修改人		修改记录
	* 2013.3.4      1.0         俞锦锦        创建
	-------------------------------------------------------------------*/
	LONG DoPreview( HWND hWnd, RECT &rectPreview, LPCTSTR szFile) ;


	/*-------------------------------------------------------------------
	* 功    能：停止预览文件
	* 输入参数： 
	* 输出参数：
	* 返 回 值： 
	* 备    注：
	* 日期			版本		修改人		修改记录
	* 2013.3.4      1.0         俞锦锦        创建
	-------------------------------------------------------------------*/
	void Unload();

private:
	/*-------------------------------------------------------------------
	* 功    能：清空类中环境变量
	* 输入参数：
	* 输出参数：
	* 返 回 值：
	* 备    注： 
	* 日期			版本		修改人		修改记录
	* 2013.3.4      1.0         俞锦锦        创建
	-------------------------------------------------------------------*/
	void ClearEnv();

	/*------------------------------------------------------------------
	* 功    能：通过IInitializeFile来初始化预览文件
	* 输入参数：szFile 文件名
	* 输出参数： 
	* 返 回 值：成功返回S_OK,失败返回错误码
	* 备    注： 
	* 日期          版本        修改人      修改记录
	* 2013.3.5      1.0         俞锦锦        创建
	---------------------------------------------------------------------*/
	HRESULT InitByIFile( LPCTSTR pchFile );



	/*------------------------------------------------------------------
	* 功    能：通过IInitializeStream来初始化预览文件
	* 输入参数：szFile 文件名
	* 输出参数： 
	* 返 回 值：成功返回S_OK,失败返回错误码
	* 备    注： 
	* 日期          版本        修改人      修改记录
	* 2013.3.5      1.0         俞锦锦        创建
	---------------------------------------------------------------------*/
	HRESULT InitByIStream( LPCTSTR pchFile );

	/*------------------------------------------------------------------
	* 功    能：通过文件名获取clsid字符串
	* 输入参数：szFile 文件名
	* 输出参数：rclsid该文件类型对应预览器的 guid 
	* 返 回 值：成功返回S_OK,失败返回错误码
	* 备    注：其中通过调用方案1-4 来获取clsid的字符串 
	* 日期          版本        修改人      修改记录
	* 2013.3.5      1.0         俞锦锦        创建
	---------------------------------------------------------------------*/
	LONG GetClsidFromFile ( IN LPCTSTR szFile,  OUT CLSID &rclsid );

 


	/*------------------------------------------------------------------
	* 功    能：通过后缀名直接获取clsid字符串 方案1
	* 输入参数：szFileExt 文件后缀
	* 输出参数：strClsid  guid字符串
	* 返 回 值：成功返回S_OK,失败返回错误码
	* 备    注：以.docx为例
	*          从 HKEY_CLASSES_ROOT\.docx\ShellEx\{8895b1c6-b41f-4c1c-a562-0d564250836f}获取
	*          若不成功，可调用方案2来尝试
	* 日期          版本        修改人      修改记录
	* 2013.3.5      1.0         俞锦锦        创建
	---------------------------------------------------------------------*/
	LONG GetClsidByExtnCase1(  IN LPCTSTR szFileExt, OUT tString& strClsid ) ;

 
	 
	/*---------------------------------------------------------------
	* 功    能：通过后缀名直接获取clsid字符串 方案2
	* 输入参数：szFileExt 文件后缀
	* 输出参数：strClsid  guid字符串
	* 返 回 值：成功返回S_OK,失败返回错误码
	* 备    注：以.html后缀为例
	*           到下面这个路径得到GUID 
	*           HKEY_CLASSES_ROOT\SystemFileAssociations\.html\ShellEx\{8895b1c6-b41f-4c1c-a562-0d564250836f}
	*           若不成功，可调用方案3来尝试
	* 日期          版本        修改人      修改记录
	* 2013.3.5      1.0         俞锦锦        创建
	--------------------------------------------------------------------*/
	LONG GetClsidByExtnCase2( IN LPCTSTR szFileExt,OUT tString& strClsid );


	/*---------------------------------------------------------------
	* 功    能：通过后缀名直接获取clsid字符串 方案3
	* 输入参数：szFileExt 文件后缀
	* 输出参数：strClsid  guid字符串
	* 返 回 值：成功返回S_OK,失败返回错误码
	* 备    注：以.txt为例
	*           先从HKEY_CLASSES_ROOT\.txt 得到PerceivedType名字的值text
	*           再到下面这个路径得到GUID 
	*           HKEY_CLASSES_ROOT\SystemFileAssociations\text\ShellEx\{8895b1c6-b41f-4c1c-a562-0d564250836f}
	*           若不成功，可调用方案4来尝试
	* 日期          版本        修改人      修改记录 
	* 2013.3.5      1.0         俞锦锦        创建
	--------------------------------------------------------------------*/
    LONG GetClsidByExtnCase3( IN LPCTSTR szFileExt,OUT tString& strClsid );


	/*---------------------------------------------------------------
	* 功    能：通过后缀名直接获取clsid字符串 方案4
	* 输入参数：szFileExt 文件后缀
	* 输出参数：strClsid  guid字符串
	* 返 回 值：成功返回S_OK,失败返回错误码
	* 备    注：以.html后缀为例
	*           先从HKEY_CLASSES_ROOT\.html得到其默认值htmlfile.
	*           再到下面这个路径得到GUID 
	*           HKEY_CLASSES_ROOT\htmlfile\ShellEx\{8895b1c6-b41f-4c1c-a562-0d564250836f}
	*           若方案1--4 都不成功，则说明该文件类型无预览器，无法预览
	* 日期          版本        修改人      修改记录
	* 2013.3.5      1.0         俞锦锦        创建
	--------------------------------------------------------------------*/
    LONG GetClsidByExtnCase4( IN LPCTSTR szFileExt,OUT tString& strClsid );

private:
	IPreviewHandler       *m_pIP ; 
	IInitializeWithFile   *m_pIFile ;
	IInitializeWithStream *m_pIStream ;
	IStream               *m_pStream;
	HGLOBAL                m_hGlobal;
	HWND                   m_hwndPreview;
	RECT                   m_rcPreview;
	static tString         m_strPreviewHandlerGUID; //previewHandler  对应的GUDI
};



