/*****************************************************************************
模块名      : cnsTool 的常量定义模块
文件名      : cnsToolConst.h
相关文件    : 所有常量数据应存放在此处
文件实现功能: 
作者        : 俞锦锦
版本        : V1.0  Copyright(C) 2011-2012 KDC, All rights reserved.
-----------------------------------------------------------------------------
修改记录:
日  期         版本        修改人      修改内容
2012/11/23     1.0         俞锦锦      创建
******************************************************************************/

//释放指针
#define SAFERELEASE(pPtr)  {if( NULL != pPtr ) \
{ \
	delete pPtr; \
pPtr = NULL; } }



 