/*=======================================================================
模块名      :
文件名      : readlicense.h
相关文件    :
文件实现功能 : 读取license文件的内容
作者        : 邵云东
版本        : KCMV1.0  Copyright(C) 2003-2008 Suzhou Keda Technology Co.Ltd
                    All rights reserved.
--------------------------------------------------------------------------
修改记录:
日  期      版本        修改人      修改内容
2007/01/09  KCM1.0      邵云东      创建
=======================================================================*/
#ifndef _READLICENSE_H_
#define _READLICENSE_H_

#include "osp.h"


#define  KDC_CALL	extern "C"

typedef struct tagKey_Value 
{
	tagKey_Value()
	{
		memset(achKey, 0, sizeof(achKey));
		memset(achValue, 0, sizeof(achValue));
	}
	s8 achKey[1024];
	s8 achValue[1024];
}TKeyValue;

/*========================================================================
函 数 名：ReadLicenseFile
功    能：读取License文件
参    数：s8 *pchPath					[in]License文件名(全路径名－请以'\0'结尾)
		  
返 回 值：u16 错误码
--------------------------------------------------------------------------
修改记录：
日		期	版本	修改人	修改内容
2007/01/09	KCM1.0	邵云东	创建
========================================================================*/
KDC_CALL u16 ReadLicenseFile(s8 *pchPath);

/*========================================================================
函 数 名：WriteLicenseFile
功    能：写License文件
参    数：BOOL32 bToUsb = FALSE             [in]    是否写入USB设备
返 回 值：u16 错误码
--------------------------------------------------------------------------
修改记录：
日		期	版本	修改人	修改内容
2007/01/09	KCM1.0	邵云东	创建
2007/06/12  1.0     王昊    允许写入USB设备
========================================================================*/
KDC_CALL u16 WriteLicenseFile(BOOL32 bToUsb = FALSE);

/*========================================================================
函 数 名：GetKeyValueNum
功    能：获取License文件中有多少Key－value值对
参    数：
返 回 值：Key－value值对数
--------------------------------------------------------------------------
修改记录：
日		期	版本	修改人	修改内容
2007/01/23	KCM1.0	邵云东	创建
========================================================================*/
KDC_CALL u16 GetKeyValueNum();
/*========================================================================
函 数 名：EnumKeyList
功    能：枚举License文件中有多少Key值
参    数：TKeyValue *pchKeyValueList	[out]Key-Value值列表
		  s32 &nListLen					[in/out]Key-Value值列表空间大小/Key-Value值数
返 回 值：u16 错误码
--------------------------------------------------------------------------
修改记录：
日		期	版本	修改人	修改内容
2007/01/09	KCM1.0	邵云东	创建
========================================================================*/
KDC_CALL u16 EnumKeyList(TKeyValue *pchKeyValueList, s32 &nListLen);
/*========================================================================
函 数 名：GetValue
功    能：根据Key值获取相应的值
参    数：s8 *pchKey					[in]Key值
		  s8 *pchValue					[out]值
		  s32 &nValueLen				[in/out]值有效长度
返 回 值：u16 错误码
--------------------------------------------------------------------------
修改记录：
日		期	版本	修改人	修改内容
2007/01/09	KCM1.0	邵云东	创建
========================================================================*/
KDC_CALL u16 GetValue(s8 *pchKey, s8 *pchValue, s32 &nValueLen);
/*========================================================================
函 数 名：GetErrorCodeDescription
功    能：获取调用产生的错误码的描述
参    数：u16 wErrorCode				[in]错误码
		  s8 *pchDescription			[out]错误码描述
		  s32 &nLen						[in/out]错误码描述有效长度
		  s8 *pchIniFilePath			[in]错误码描述文件全路径(包括文件名)，请以'\0'结尾
返 回 值：BOOL32 TRUE : 成功   FALSE : 失败
--------------------------------------------------------------------------
修改记录：
日		期	版本	修改人	修改内容
2007/01/09	KCM1.0	邵云东	创建
========================================================================*/
KDC_CALL BOOL32 GetErrorCodeDescription(u16 wErrorCode, s8 *pchDescription, s32 &nLen, s8 *pchIniFilePath);

/*=============================================================================
函 数 名: SetValue
功    能: 向内存设置数据
参    数: LPCSTR lpszKey                    [in]    段名
          LPCSTR lpszValue                  [in]    键值
注    意: 仅刷新读取出的数据内存
返 回 值: 错误码
-------------------------------------------------------------------------------
修改纪录:
日      期  版本    修改人  修改内容
2007/06/12  1.0     王昊    创建
=============================================================================*/
KDC_CALL u16 SetValue(LPCSTR lpszKey, LPCSTR lpszValue);


#endif // _READLICENSE_H_

